
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Наименование");
    Поля.Добавить("ДействуетНаОсновании"); 
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Не СтандартнаяОбработка Тогда
        Возврат;
    КонецЕсли;

    СтандартнаяОбработка = Ложь;

    Если ПустаяСтрока(Данные.ДействуетНаОсновании) Тогда
        Представление = Данные.Наименование;
    Иначе
        Представление = Данные.Наименование + " (" + Данные.ДействуетНаОсновании + ")";
	КонецЕсли;
	
КонецПроцедуры
