#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервере(Форма) Экспорт
	//++ Беляева Ю.Ф. ____16.09.2026
	// дорабатываю формы документов (вставка поля контактное лицо после договора)
    ИмяФормы = Форма.ИмяФормы;
	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		//++ Беляева Ю.Ф. ____17.09.2026 задание 2 добавляю скидку
		ДобавитьСогласованнаяСкидкаВГруппаШапкаЛево(Форма);   
	ИначеЕсли
		ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли
		ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли
		ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);  
		ИначеЕсли
		ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);    
	КонецЕсли;    
		
КонецПроцедуры

Процедура ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);             
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры               

Процедура ВставитьКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);             
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры     


//++ Беляева Ю.Ф. ____22.07.2026 добавляю скидку в шапку документа
Процедура ДобавитьСогласованнаяСкидкаВГруппаШапкаЛево(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);             
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ПолеВвода.Заголовок = "Согласованная скидка, %";
	ПолеВвода.Ширина = 10;
				
КонецПроцедуры        
   
#КонецОбласти
